layers/LAYERS.org
#+TITLE: Configuration layers
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/readtheorg.css" />

* Table of Contents                                      :TOC_4_org:noexport:
 - [[General layers][General layers]]
 - [[Configuration files][Configuration files]]
 - [[E-mail][E-mail]]
 - [[Frameworks][Frameworks]]
 - [[Fun][Fun]]
 - [[IRC][IRC]]
 - [[Keyboard layouts][Keyboard layouts]]
 - [[Programming languages][Programming languages]]
 - [[Source control][Source control]]
 - [[Tools][Tools]]
 - [[Vim][Vim]]
 - [[Window management][Window management]]

* General layers
- [[file:auto-completion/README.org][auto-completion]]
- [[file:better-defaults/README.org][better-defaults]]
- [[file:chinese/README.org][chinese]]
- [[file:chrome/README.org][chrome]]
- [[file:colors/README.org][colors]]
- [[file:cscope/README.org][cscope]]
- [[file:deft/README.org][deft]]
- [[file:finance/README.org][finance]]
- [[file:floobits/README.org][floobits]]
- [[file:geolocation/README.org][geolocation]]
- [[file:gtags/README.org][gtags]]
- [[file:ibuffer/README.org][ibuffer]]
- [[file:jabber/README.org][jabber]]
- [[file:nixos/README.org][nixos]]
- [[file:org/README.org][org]]
- [[file:osx/README.org][osx]]
- [[file:prodigy/README.org][prodigy]]
- [[file:restclient/README.org][restclient]]
- [[file:search-engine/README.org][search-engine]]
- [[file:semantic/README.org][semantic]]
- [[file:shell/README.org][shell]]
- [[file:smex/README.org][smex]]
- [[file:speed-reading/README.org][speed-reading]]
- [[file:spell-checking/README.org][spell-checking]]
- [[file:spotify/README.org][spotify]]
- [[file:syntax-checking/README.org][syntax-checking]]
- [[file:themes-megapack/README.org][themes-megapack]]
- [[file:theming/README.org][theming]]
- [[file:typography/README.org][typography]]

* Configuration files
- [[file:+config-files/ansible/README.org][ansible]]
- [[file:+config-files/dockerfile/README.org][dockerfile]]
- [[file:+config-files/puppet/README.org][puppet]]
- [[file:+config-files/salt/README.org][salt]]
- [[file:+config-files/terraform/README.org][terraform]]

* E-mail
- [[file:+email/gnus/README.org][gnus]]
- [[file:+email/mu4e/README.org][mu4e]]

* Frameworks
- [[file:+frameworks/django/README.org][django]]
- [[file:+frameworks/react/README.org][react]]
- [[file:+frameworks/ruby-on-rails/README.org][ruby-on-rails]]

* Fun
- [[file:+fun/emoji/README.org][emoji]]
- [[file:+fun/games/README.org][games]]
- [[file:+fun/selectric/README.org][selectric]]
- [[file:+fun/xkcd/README.org][xkcd]]

* IRC
- [[file:+irc/erc/README.org][erc]]
- [[file:+irc/rcirc/README.org][rcirc]]

* Keyboard layouts
- [[file:+keyboard-layouts/bepo/README.org][bepo]]

* Programming languages
- [[file:+lang/agda/README.org][agda]]
- [[file:+lang/asciidoc/README.org][asciidoc]]
- [[file:+lang/autohotkey/README.org][autohotkey]]
- [[file:+lang/c-c++/README.org][c-c++]]
- [[file:+lang/clojure/README.org][clojure]]
- [[file:+lang/common-lisp/README.org][common-lisp]]
- [[file:+lang/csharp/README.org][csharp]]
- [[file:+lang/d/README.org][d]]
- [[file:+lang/elixir/README.org][elixir]]
- [[file:+lang/elm/README.org][elm]]
- [[file:+lang/emacs-lisp/README.org][emacs-lisp]]
- [[file:+lang/erlang/README.org][erlang]]
- [[file:+lang/ess/README.org][ess]]
- [[file:+lang/extra-langs/README.org][extra-langs]]
- [[file:+lang/fsharp/README.org][fsharp]]
- [[file:+lang/go/README.org][go]]
- [[file:+lang/haskell/README.org][haskell]]
- [[file:+lang/html/README.org][html]]
- [[file:+lang/idris/README.org][idris]]
- [[file:+lang/ipython-notebook/README.org][ipython-notebook]]
- [[file:+lang/java/README.org][java]]
- [[file:+lang/javascript/README.org][javascript]]
- [[file:+lang/latex/README.org][latex]]
- [[file:+lang/lua/README.org][lua]]
- [[file:+lang/markdown/README.org][markdown]]
- [[file:+lang/nim/README.org][nim]]
- [[file:+lang/ocaml/README.org][ocaml]]
- [[file:+lang/octave/README.org][octave]]
- [[file:+lang/php/README.org][php]]
- [[file:+lang/purescript/README.org][purescript]]
- [[file:+lang/python/README.org][python]]
- [[file:+lang/racket/README.org][racket]]
- [[file:+lang/ruby/README.org][ruby]]
- [[file:+lang/rust/README.org][rust]]
- [[file:+lang/scala/README.org][scala]]
- [[file:+lang/scheme/README.org][scheme]]
- [[file:+lang/shell-scripts/README.org][shell-scripts]]
- [[file:+lang/sml/README.org][sml]]
- [[file:+lang/sql/README.org][sql]]
- [[file:+lang/swift/README.org][swift]]
- [[file:+lang/typescript/README.org][typescript]]
- [[file:+lang/vimscript/README.org][vimscript]]
- [[file:+lang/windows-scripts/README.org][windows-scripts]]
- [[file:+lang/yaml/README.org][yaml]]

* Source control
- [[file:+source-control/git/README.org][git]]
- [[file:+source-control/github/README.org][github]]
- [[file:+source-control/perforce/README.org][perforce]]
- [[file:+source-control/version-control/README.org][version-control]]

* Tools
- [[file:+tools/command-log/README.org][command-log]]
- [[file:+tools/dash/README.org][dash]]
- [[file:+tools/elfeed/README.org][elfeed]]
- [[file:+tools/evernote/README.org][evernote]]
- [[file:+tools/fasd/README.org][fasd]]
- [[file:+tools/pandoc/README.org][pandoc]]
- [[file:+tools/ranger/README.org][ranger]]
- [[file:+tools/tmux/README.org][tmux]]
- [[file:+tools/vagrant/README.org][vagrant]]
- [[file:+tools/wakatime/README.org][wakatime]]
- [[file:+tools/ycmd/README.org][ycmd]]

* Vim
- [[file:+vim/evil-cleverparens/README.org][evil-cleverparens]]
- [[file:+vim/evil-commentary/README.org][evil-commentary]]
- [[file:+vim/evil-snipe/README.org][evil-snipe]]
- [[file:+vim/unimpaired/README.org][unimpaired]]
- [[file:+vim/vim-empty-lines/README.org][vim-empty-lines]]
- [[file:+vim/vim-powerline/README.org][vim-powerline]]
- [[file:+vim/vinegar/README.org][vinegar]]

* Window management
- [[file:+window-management/eyebrowse/README.org][eyebrowse]]
- [[file:+window-management/spacemacs-layouts/README.org][spacemacs-layouts]]
