layers/LAYERS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-12-02 Wed 14:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Configuration layers</title>
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css"
                 href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css" />
</head>
<body>
<div id="content">
<div id="toggle-sidebar"><a href="#table-of-contents"><h2>Table of Contents</h2></a></div>
<h1 class="title">Configuration layers</h1>
<div id="table-of-contents">
<h2>Table of Contents<a href="#">Close</a></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. General layers</a></li>
<li><a href="#orgheadline2">2. Configuration files</a></li>
<li><a href="#orgheadline3">3. E-mail</a></li>
<li><a href="#orgheadline4">4. Frameworks</a></li>
<li><a href="#orgheadline5">5. Fun</a></li>
<li><a href="#orgheadline6">6. IRC</a></li>
<li><a href="#orgheadline7">7. Keyboard layouts</a></li>
<li><a href="#orgheadline8">8. Programming languages</a></li>
<li><a href="#orgheadline9">9. Source control</a></li>
<li><a href="#orgheadline10">10. Tools</a></li>
<li><a href="#orgheadline11">11. Vim</a></li>
<li><a href="#orgheadline12">12. Window management</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> General layers</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="auto-completion/README.html">auto-completion</a></li>
<li><a href="better-defaults/README.html">better-defaults</a></li>
<li><a href="chinese/README.html">chinese</a></li>
<li><a href="chrome/README.html">chrome</a></li>
<li><a href="colors/README.html">colors</a></li>
<li><a href="cscope/README.html">cscope</a></li>
<li><a href="deft/README.html">deft</a></li>
<li><a href="finance/README.html">finance</a></li>
<li><a href="floobits/README.html">floobits</a></li>
<li><a href="geolocation/README.html">geolocation</a></li>
<li><a href="gtags/README.html">gtags</a></li>
<li><a href="ibuffer/README.html">ibuffer</a></li>
<li><a href="jabber/README.html">jabber</a></li>
<li><a href="nixos/README.html">nixos</a></li>
<li><a href="org/README.html">org</a></li>
<li><a href="osx/README.html">osx</a></li>
<li><a href="prodigy/README.html">prodigy</a></li>
<li><a href="restclient/README.html">restclient</a></li>
<li><a href="search-engine/README.html">search-engine</a></li>
<li><a href="semantic/README.html">semantic</a></li>
<li><a href="shell/README.html">shell</a></li>
<li><a href="smex/README.html">smex</a></li>
<li><a href="speed-reading/README.html">speed-reading</a></li>
<li><a href="spell-checking/README.html">spell-checking</a></li>
<li><a href="spotify/README.html">spotify</a></li>
<li><a href="syntax-checking/README.html">syntax-checking</a></li>
<li><a href="themes-megapack/README.html">themes-megapack</a></li>
<li><a href="theming/README.html">theming</a></li>
<li><a href="typography/README.html">typography</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Configuration files</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="+config-files/ansible/README.html">ansible</a></li>
<li><a href="+config-files/dockerfile/README.html">dockerfile</a></li>
<li><a href="+config-files/puppet/README.html">puppet</a></li>
<li><a href="+config-files/salt/README.html">salt</a></li>
<li><a href="+config-files/terraform/README.html">terraform</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> E-mail</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="+email/gnus/README.html">gnus</a></li>
<li><a href="+email/mu4e/README.html">mu4e</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Frameworks</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="+frameworks/django/README.html">django</a></li>
<li><a href="+frameworks/react/README.html">react</a></li>
<li><a href="+frameworks/ruby-on-rails/README.html">ruby-on-rails</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Fun</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li><a href="+fun/emoji/README.html">emoji</a></li>
<li><a href="+fun/games/README.html">games</a></li>
<li><a href="+fun/xkcd/README.html">xkcd</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> IRC</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="+irc/erc/README.html">erc</a></li>
<li><a href="+irc/rcirc/README.html">rcirc</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> Keyboard layouts</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li><a href="+keyboard-layouts/bepo/README.html">bepo</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> Programming languages</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li><a href="+lang/agda/README.html">agda</a></li>
<li><a href="+lang/asciidoc/README.html">asciidoc</a></li>
<li><a href="+lang/autohotkey/README.html">autohotkey</a></li>
<li><a href="+lang/c-c++/README.html">c-c++</a></li>
<li><a href="+lang/clojure/README.html">clojure</a></li>
<li><a href="+lang/common-lisp/README.html">common-lisp</a></li>
<li><a href="+lang/csharp/README.html">csharp</a></li>
<li><a href="+lang/d/README.html">d</a></li>
<li><a href="+lang/elixir/README.html">elixir</a></li>
<li><a href="+lang/elm/README.html">elm</a></li>
<li><a href="+lang/emacs-lisp/README.html">emacs-lisp</a></li>
<li><a href="+lang/erlang/README.html">erlang</a></li>
<li><a href="+lang/ess/README.html">ess</a></li>
<li><a href="+lang/extra-langs/README.html">extra-langs</a></li>
<li><a href="+lang/fsharp/README.html">fsharp</a></li>
<li><a href="+lang/go/README.html">go</a></li>
<li><a href="+lang/haskell/README.html">haskell</a></li>
<li><a href="+lang/html/README.html">html</a></li>
<li><a href="+lang/idris/README.html">idris</a></li>
<li><a href="+lang/ipython-notebook/README.html">ipython-notebook</a></li>
<li><a href="+lang/java/README.html">java</a></li>
<li><a href="+lang/javascript/README.html">javascript</a></li>
<li><a href="+lang/latex/README.html">latex</a></li>
<li><a href="+lang/lua/README.html">lua</a></li>
<li><a href="+lang/markdown/README.html">markdown</a></li>
<li><a href="+lang/nim/README.html">nim</a></li>
<li><a href="+lang/ocaml/README.html">ocaml</a></li>
<li><a href="+lang/php/README.html">php</a></li>
<li><a href="+lang/purescript/README.html">purescript</a></li>
<li><a href="+lang/python/README.html">python</a></li>
<li><a href="+lang/racket/README.html">racket</a></li>
<li><a href="+lang/ruby/README.html">ruby</a></li>
<li><a href="+lang/rust/README.html">rust</a></li>
<li><a href="+lang/scala/README.html">scala</a></li>
<li><a href="+lang/scheme/README.html">scheme</a></li>
<li><a href="+lang/shell-scripts/README.html">shell-scripts</a></li>
<li><a href="+lang/sml/README.html">sml</a></li>
<li><a href="+lang/sql/README.html">sql</a></li>
<li><a href="+lang/typescript/README.html">typescript</a></li>
<li><a href="+lang/vimscript/README.html">vimscript</a></li>
<li><a href="+lang/windows-scripts/README.html">windows-scripts</a></li>
<li><a href="+lang/yaml/README.html">yaml</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> Source control</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li><a href="+source-control/git/README.html">git</a></li>
<li><a href="+source-control/github/README.html">github</a></li>
<li><a href="+source-control/perforce/README.html">perforce</a></li>
<li><a href="+source-control/version-control/README.html">version-control</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">10</span> Tools</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li><a href="+tools/dash/README.html">dash</a></li>
<li><a href="+tools/evernote/README.html">evernote</a></li>
<li><a href="+tools/fasd/README.html">fasd</a></li>
<li><a href="+tools/pandoc/README.html">pandoc</a></li>
<li><a href="+tools/ranger/README.html">ranger</a></li>
<li><a href="+tools/tmux/README.html">tmux</a></li>
<li><a href="+tools/vagrant/README.html">vagrant</a></li>
<li><a href="+tools/wakatime/README.html">wakatime</a></li>
<li><a href="+tools/ycmd/README.html">ycmd</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">11</span> Vim</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li><a href="+vim/evil-cleverparens/README.html">evil-cleverparens</a></li>
<li><a href="+vim/evil-commentary/README.html">evil-commentary</a></li>
<li><a href="+vim/evil-snipe/README.html">evil-snipe</a></li>
<li><a href="+vim/unimpaired/README.html">unimpaired</a></li>
<li><a href="+vim/vim-empty-lines/README.html">vim-empty-lines</a></li>
<li><a href="+vim/vim-powerline/README.html">vim-powerline</a></li>
<li><a href="+vim/vinegar/README.html">vinegar</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">12</span> Window management</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><a href="+window-management/eyebrowse/README.html">eyebrowse</a></li>
<li><a href="+window-management/spacemacs-layouts/README.html">spacemacs-layouts</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-12-02 Wed 14:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
